#### 订单查询(OrderQuery)
#### 说明
用于查询和展示订单列表，并且可以选择某条删除

#### 依赖模块

#### 代码示范
```vue

```

#### 参数说明
+ 内部参数(data)

| 参数名| 参数说明| 何时改变|类型|可选值|默认值|
| - |:-:|:-:|:-:|:-:|:-:|
| condition| 查询条件 | 单击查询按钮时 |Object|-|-|

+ 外部参数(props)

| 参数名| 参数说明| 详述|类型|可选值|默认值|
| - |:-:|:-:|:-:|:-:|:-:|
|-|-|-|-|-|-|

+ 事件(events)

| 事件名| 说明| 回调参数 |
| - |:-:|:-:|
|- |- |- |

+ 函数(methods)

| 函数名名| 说明| 参数 |
| - |:-:|:-:|
|add |跳转至新建订单页面 |- |
|edit |跳转至修改订单页面 |id |
|queryOrder |查询订单列表 |condition |
|delOrder |删除某条记录 |id |
#### 变更日志

2017-11-20 -组件创建 by syz。